### First look into data from Kaggle competition "Warmup Round - March Machine Learning Mania 2023"
https://www.kaggle.com/competitions/warmup-round-march-machine-learning-mania-2023

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import glob
import xgboost as xgb

In [11]:
for name in glob.glob("./data/*.csv"):
    print(name)

./data\Cities.csv
./data\Conferences.csv
./data\MConferenceTourneyGames.csv
./data\MGameCities.csv
./data\MMasseyOrdinals.csv
./data\MNCAATourneyCompactResults.csv
./data\MNCAATourneyDetailedResults.csv
./data\MNCAATourneySeedRoundSlots.csv
./data\MNCAATourneySeeds.csv
./data\MNCAATourneySlots.csv
./data\MRegularSeasonCompactResults.csv
./data\MRegularSeasonDetailedResults.csv
./data\MSeasons.csv
./data\MSecondaryTourneyCompactResults.csv
./data\MSecondaryTourneyTeams.csv
./data\MTeamCoaches.csv
./data\MTeamConferences.csv
./data\MTeams.csv
./data\MTeamSpellings.csv
./data\SampleSubmissionWarmup.csv
./data\WGameCities.csv
./data\WNCAATourneyCompactResults.csv
./data\WNCAATourneyDetailedResults.csv
./data\WNCAATourneySeeds.csv
./data\WNCAATourneySlots.csv
./data\WRegularSeasonCompactResults.csv
./data\WRegularSeasonDetailedResults.csv
./data\WSeasons.csv
./data\WTeamConferences.csv
./data\WTeams.csv
./data\WTeamSpellings.csv

In [13]:
df = pd.read_csv('data/Cities.csv')

In [15]:
df.describe()

            CityID
count   472.000000
mean   4240.847458
std     142.509574
min    4001.000000
25%    4118.750000
50%    4236.500000
75%    4355.250000
max    4494.000000

In [16]:
df.head()

   CityID         City State
0    4001      Abilene    TX
1    4002        Akron    OH
2    4003       Albany    NY
3    4004  Albuquerque    NM
4    4005    Allentown    PA